## Staging: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 8 to add, 1 to change, 4 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                          NAME                                          |
|----------|----------------------------------------------------------------------------------------|
| add      | `aws_lb_listener_rule.https_reponses`                                                  |
|          | `aws_route53_record.ai_answers_alt`                                                    |
|          | `aws_route53_record.ai_answers_certificate_validation[&quot;*.reponses-ia.cdssandbox.xyz&quot;]` |
|          | `aws_route53_record.ai_answers_certificate_validation[&quot;reponses-ia.cdssandbox.xyz&quot;]`   |
| update   | `aws_lb_listener.ai_answers_listener`                                                  |
| recreate | `aws_acm_certificate.ai_answers`                                                       |
|          | `aws_acm_certificate_validation.ai_answers`                                            |
|          | `aws_route53_record.ai_answers_certificate_validation[&quot;*.ai-answers.cdssandbox.xyz&quot;]`  |
|          | `aws_route53_record.ai_answers_certificate_validation[&quot;ai-answers.cdssandbox.xyz&quot;]`    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_acm_certificate.ai_answers must be replaced
+/- resource "aws_acm_certificate" "ai_answers" {
      ~ arn                       = "arn:aws:acm:ca-central-1:992382783569:certificate/9b980aa4-5e34-4a39-b9cf-f30cfc2ebbe4" -> (known after apply)
      ~ domain_validation_options = [
          - {
              - domain_name           = "*.ai-answers.cdssandbox.xyz"
              - resource_record_name  = "_ab895a9c66d5f72b27cf3ee439b88a3c.ai-answers.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_1dbd5854332f001e1530bb32d82decb2.zfyfvmchrl.acm-validations.aws."
            },
          - {
              - domain_name           = "ai-answers.cdssandbox.xyz"
              - resource_record_name  = "_ab895a9c66d5f72b27cf3ee439b88a3c.ai-answers.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_1dbd5854332f001e1530bb32d82decb2.zfyfvmchrl.acm-validations.aws."
            },
          + {
              + domain_name           = "*.ai-answers.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "*.reponses-ia.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "ai-answers.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "reponses-ia.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      ~ id                        = "arn:aws:acm:ca-central-1:992382783569:certificate/9b980aa4-5e34-4a39-b9cf-f30cfc2ebbe4" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      ~ not_after                 = "2026-09-11T23:59:59Z" -> (known after apply)
      ~ not_before                = "2025-08-13T00:00:00Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          + "*.reponses-ia.cdssandbox.xyz",
          + "reponses-ia.cdssandbox.xyz",
            # (2 unchanged elements hidden)
        ]
        tags                      = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
      ~ type                      = "AMAZON_ISSUED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ options (known after apply)
      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_acm_certificate_validation.ai_answers must be replaced
-/+ resource "aws_acm_certificate_validation" "ai_answers" {
      ~ certificate_arn         = "arn:aws:acm:ca-central-1:992382783569:certificate/9b980aa4-5e34-4a39-b9cf-f30cfc2ebbe4" -> (known after apply) # forces replacement
      ~ id                      = "2025-08-13 15:09:32.648 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [
          - "_ab895a9c66d5f72b27cf3ee439b88a3c.ai-answers.cdssandbox.xyz",
        ] -> (known after apply) # forces replacement
    }

  # aws_lb_listener.ai_answers_listener will be updated in-place
  ~ resource "aws_lb_listener" "ai_answers_listener" {
      ~ certificate_arn                                                       = "arn:aws:acm:ca-central-1:992382783569:certificate/9b980aa4-5e34-4a39-b9cf-f30cfc2ebbe4" -> (known after apply)
        id                                                                    = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:listener/app/ai-answers-lb/054264388446064f/9f4e1b4b69a68aad"
        tags                                                                  = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
        # (25 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lb_listener_rule.https_reponses will be created
  + resource "aws_lb_listener_rule" "https_reponses" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:listener/app/ai-answers-lb/054264388446064f/9f4e1b4b69a68aad"
      + priority     = 110
      + tags_all     = {
          + "CostCentre" = "ai-answers-staging"
          + "Terraform"  = "true"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:targetgroup/ai-answers/2ad377cc9d36fc44"
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "reponses-ia.cdssandbox.xyz",
                ]
            }
        }
    }

  # aws_route53_record.ai_answers_alt will be created
  + resource "aws_route53_record" "ai_answers_alt" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "reponses-ia.cdssandbox.xyz"
      + type            = "A"
      + zone_id         = "Z0584852191PDPIIGRCYZ"

      + alias {
          + evaluate_target_health = false
          + name                   = "ai-answers-lb-1206359941.ca-central-1.elb.amazonaws.com"
          + zone_id                = "ZQSVJUPU6J1EY"
        }
    }

  # aws_route53_record.ai_answers_certificate_validation["*.ai-answers.cdssandbox.xyz"] must be replaced
-/+ resource "aws_route53_record" "ai_answers_certificate_validation" {
      ~ fqdn                             = "_ab895a9c66d5f72b27cf3ee439b88a3c.ai-answers.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z0155535SR6XQTKZDGDA__ab895a9c66d5f72b27cf3ee439b88a3c.ai-answers.cdssandbox.xyz._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "_ab895a9c66d5f72b27cf3ee439b88a3c.ai-answers.cdssandbox.xyz" -> (known after apply) # forces replacement
      ~ records                          = [
          - "_1dbd5854332f001e1530bb32d82decb2.zfyfvmchrl.acm-validations.aws.",
        ] -> (known after apply)
      ~ type                             = "CNAME" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_route53_record.ai_answers_certificate_validation["*.reponses-ia.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "ai_answers_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z0155535SR6XQTKZDGDA"
    }

  # aws_route53_record.ai_answers_certificate_validation["ai-answers.cdssandbox.xyz"] must be replaced
-/+ resource "aws_route53_record" "ai_answers_certificate_validation" {
      ~ fqdn                             = "_ab895a9c66d5f72b27cf3ee439b88a3c.ai-answers.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z0155535SR6XQTKZDGDA__ab895a9c66d5f72b27cf3ee439b88a3c.ai-answers.cdssandbox.xyz._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "_ab895a9c66d5f72b27cf3ee439b88a3c.ai-answers.cdssandbox.xyz" -> (known after apply) # forces replacement
      ~ records                          = [
          - "_1dbd5854332f001e1530bb32d82decb2.zfyfvmchrl.acm-validations.aws.",
        ] -> (known after apply)
      ~ type                             = "CNAME" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_route53_record.ai_answers_certificate_validation["reponses-ia.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "ai_answers_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z0155535SR6XQTKZDGDA"
    }

Plan: 8 to add, 1 to change, 4 to destroy.

Changes to Outputs:
  ~ lb_listener                 = {
      ~ certificate_arn                                                       = "arn:aws:acm:ca-central-1:992382783569:certificate/9b980aa4-5e34-4a39-b9cf-f30cfc2ebbe4" -> (known after apply)
        id                                                                    = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:listener/app/ai-answers-lb/054264388446064f/9f4e1b4b69a68aad"
        tags                                                                  = {
            CostCentre = "ai-answers-staging"
            Terraform  = "true"
        }
        # (30 unchanged attributes hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener_rule.https_reponses"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
